Revit 2027 API
SlabShapeEditor.PickSupport Method
Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PickSupport(
	Line gLine
)
Public Sub PickSupport (
	gLine As Line
)
public:
void PickSupport(
	Line^ gLine
)
member PickSupport :
        gLine : Line -> unit
Parameters
gLine Line
A line from a support element such as a beam.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input line is null.
ArgumentException |  Thrown when the input line is invalid.
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace